In [ ]:
import numpy as np
import pandas as pd

In [ ]:
series = pd.Series(['하나', '둘', '셋', '넷', '다섯', '여섯', '일곱',' 여덟', '아홉', '열'], index = [_ for _ in range(1,11)])
series

## object 객체는 최상위의 객체, 모든 걸 포괄할 수 있는 객체

In [ ]:
s = pd.Series([9_904_312, 3_448_737, 2_890_451, 2_466_052], index = ['서울', '부산', '인천', '대구'])
s.index
s.values

In [ ]:
s.name = "인구"
s.index.name = "도시"

In [ ]:
s

In [ ]:
dict = {'a' : 1, 'b' : 2, 'c' : 3}
ser = pd.Series(data = dict, index = ['x','y','z'])
ser

In [ ]:
s2 = pd.Series({'서울' : 9_904_312,
                '부산' : 3_448_737,
                '인천' : 2_890_451,
                '대구' : 2_466_052})
s2

In [ ]:
s = pd.Series([99040312, 3448737, 2890452, 2466052], index = ['서울','부산','인천','대구'])

In [ ]:
s - s2

In [ ]:
rs = pd.Series([1.636984, 2.832690, 9.818107], index = ['부산','서울','인천'])
rs['부산'] = 1.63
rs

In [ ]:
rs['대구'] = 1.41
rs

In [ ]:
del rs['서울']
rs

In [ ]:
fin1 = {'카카오':60010, '삼성전자':61000, 'LG전자':90000}
fin2_value = [60200, 61200, 200100]
fin2_index = ['카카오','삼성전자','네이버']

ser_finance1 = pd.Series(fin1)
ser_finance2 = pd.Series(fin2_value, index = fin2_index)

In [ ]:
result = ser_finance1 - ser_finance2
result[result.notnull()]

In [ ]:
ser_finance1 + ser_finance2

In [ ]:
ser_finance1 * ser_finance2

In [ ]:
ser_finance1 / ser_finance2

In [ ]:
d = {'col1' : [1,2], 'col2' : [3, 4]}
df = pd.DataFrame(data = d)
df

In [ ]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

In [ ]:
dict_ = {'코스피' : ['하락', '하락', '상승', '상승', '하락'],
        '코스피 지수' : [2359.53, 2365.10, 2386.09, 2399.86, 2379.39],
        '두산에너빌리티' : [16400, 16900, 17150, 16500, 16300],
        '삼성전자' : [60500, 60500, 60800, 61100, 61000],
        '셀바스AI' : [8250, 7980, 8510, 8600, 8820],
        '레인보우로보틱스' : [53700, 49750, 54700, 56700, 63200],
        }
df = pd.DataFrame(dict_, index = ['2023.01.11', '2023.01.12', '2023.01.13', '2023.01.16', '2023.01.17'])
# df.columns.name = '주가'
# df.index.name = '날짜'
df

In [ ]:
df.head(1)

In [ ]:
df[:1]

In [ ]:
df[1:3]

In [ ]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

In [ ]:
# 1번
df['수학']

# 2번
df[['국어','영어']]

# 3번
df['평균' ] = (df['국어'] + df['영어'] + df['수학']) / 3

# 4번
df['영어']['방자'] = 80
df['평균' ] = (df['국어'] + df['영어'] + df['수학']) / 3

# 5번
df['춘향':'춘향']

# 6번
df.T['향단']

In [ ]:
df.T['향단']

In [ ]:
df

In [ ]:
np.random.seed(0)
pd.DataFrame(np.random.randn(6,4), index = pd.date_range("20130206", periods = 6), columns = ['A', 'B','C','D'])

In [ ]:
class Team:
    
    ### 클래스 속성
    '''팀 객체를 만듭니다'''
    count = 0
    order = []
    def __init__(self, number, name = None,  member = set()):
        
        ### 인스턴스 속성
        self.number = number
        self.name = name
        self.member = member
        Team.count += 1
        Team.order.append(number)
        
    def add_member(self, name):
        '''팀원을 추가합니다'''
        # 해당 이름이 팀에 없을 경우
        if name not in self.member:
            self.member.add(name)
            print(f'{name}님을 팀 {self.number}에 추가했습니다.')
            
        # 해당 이름이 팀에 있을 경우
        else:
            print(f'{name}님은 이미 팀에 있습니다.')
            
    def rm_member(self, name):
        '''팀원을 삭제합니다'''
        if name in self.member:
            self.member.remove(name)
            print(f'{name}님을 팀에서 삭제했습니다.')
        else :
            print(f'{name}님은 해당 팀에 없습니다.')
            
    def get_count(self):
        '''팀의 수를 리턴합니다'''
        return Team.count

    def get_order(self):
        '''팀 생성 순서를 받습니다'''
        return Team.order
    
    def set_order(self, x):
        '''팀 순서를 조정합니다'''
        if x in Team.order:
            Team.order.remove(x)
            Team.order.append(x)
        else :
            Team.order.append(x)
    
    def __len__(self):
        '''각 팀의 멤버 수를 리턴합니다'''
        return len(self.member)

In [ ]:
s = '서울특별시'
if '서울' in s :
    print('hi')

In [ ]:
import pandas as pd
data = pd.Series([963122133, 51561512, 515485 , 19815152], index = ['서울', '부산', '인천', '대구'])

In [ ]:
data.index.name = '도시'

In [ ]:
data

In [ ]:
dict_ = {'c1' : [1,2,'누락'], 'c2' : [1.11, '', '3.33'], 'c3' : ['one', 'two', 'three']}
df = pd.DataFrame(dict_)
df.to_csv('data/sample1.csv', index = False, encoding = 'utf-8-sig')
# df.to_csv('C:/python/data/sample1.csv')

In [ ]:
df_read = pd.read_csv('data/sample1.csv')
df_read

In [ ]:
df.to_csv('data/sample2.csv', index = False, header = False)

In [ ]:
df = pd.read_csv('data/sample2.csv', self.members = ['c1','c2','c3'])

In [ ]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

In [ ]:
df = pd.read_table('sample3.txt', sep = '\s+')

In [ ]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

In [ ]:
pd.read_csv('sample4.txt', skiprows = [0,1])

In [ ]:
df_na_val = pd.read_csv('data/sample1.csv', na_values = ['누락'])
df_na_val

In [ ]:
df_na_val.to_csv('sample5.txt', sep = '|')

In [ ]:
df_na_val.to_csv('sample5.txt', na_rep ='누락')

In [ ]:
tt = pd.read_csv('https://storage.googleapis.com/tf-datasets/titanic/train.csv')

In [ ]:
tt

In [ ]:
import numpy as np
df = pd.DataFrame(np.array(range(10,22)).reshape(3,4),
                index = ['a','b','c'],
                columns = ['A','B','C','D'])
df

In [ ]:
df.loc['a']

In [ ]:
df.loc[["b","c"]]

In [ ]:
df["b":"c"]

In [ ]:
df.A

In [1]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head(5)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
titanic['category1'] = titanic.apply(lambda x : x['sex'] if x['age'] > 20 else 'child', axis = 1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

In [12]:
titanic.loc[titanic['age'].isna() == True, 'age'] = titanic['age'].mean()

In [26]:
titanic['age'] = titanic['age'].astype('int')
titanic['category2'] = titanic.apply(lambda x : x['sex'] + x['age'], axis = 1)

ValueError: invalid literal for int() with base 10: '22.0'

In [24]:
titanic['age']

0                   22.0
1                   38.0
2                   26.0
3                   35.0
4                   35.0
             ...
886                 27.0
887                 19.0
888    29.69911764705882
889                 26.0
890                 32.0
Name: age, Length: 891, dtype: object

In [78]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.loc[titanic['age'].isna() == True, 'age'] = titanic['age'].mean()

bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "장년", "중년", "노년"]

titanic['age'] = pd.cut(titanic['age'], bins, labels = labels)
titanic['age'].value_counts(normalize = True)

1.0

In [79]:
titanic['age'].value_counts(normalize = True)

청년      0.464082
장년      0.274800
미성년자    0.188141
중년      0.067275
노년      0.005701
Name: age, dtype: float64

In [15]:
titanic['age'].isna().sum()

0

In [ ]:
titanic['sex'].value_counts()
titanic['sex'].sort_values(ascending = False)
titanic['age'].value_counts()
titanic['age'].sort_values(ascending = False)
titanic['class'].value_counts()
titanic['class'].sort_values(ascending = False)
titanic['alive'].value_counts()
titanic['alive'].sort_values(ascending = False)

In [ ]:
titanic.count()

In [ ]:
s2 = pd.Series(np.random.randint(6, size = 100))

In [ ]:
s2.value_counts().sort_index()

In [ ]:
titanic.value_counts(subset = 'sex')

In [ ]:
titanic['age'].mean()
titanic.loc[titanic['sex'] == 'female', 'age'].mean()
titanic.loc[(titanic['pclass'] == 1) & (titanic['sex'] == 'female'), 'age'].mean()

In [453]:
members = "강지인 김강직 김경목 김기훈 김민수 김예린 김유림 김호영 도강현 맹지호 민병창 서영호 신제우 우상욱 윤규헌 이민호 이병호 이선주 이호진 허경모 황도희".split()

In [454]:
tb = TeamBuilder(members, 7)
tb.creat_team()
tb.show_team_info()

기존의 팀 정보를 지우고 새로 생성합니다.
[['도강현', '김강직', '김민수', '이민호', '김유림', '김예린'], ['우상욱', '강지인', '허경모', '황도희', '서영호'], ['김호영', '김경목', '윤규헌', '민병창', '이호진'], ['신제우', '맹지호', '김기훈', '이병호', '이선주']]
팀을 4개 생성했습니다
1팀은 도강현 김강직 김민수 이민호 김유림 김예린 입니다.
2팀은 우상욱 강지인 허경모 황도희 서영호 입니다.
3팀은 김호영 김경목 윤규헌 민병창 이호진 입니다.
4팀은 신제우 맹지호 김기훈 이병호 이선주 입니다.

[['도강현', '김강직', '김민수', '이민호', '김유림', '김예린'],
 ['우상욱', '강지인', '허경모', '황도희', '서영호'],
 ['김호영', '김경목', '윤규헌', '민병창', '이호진'],
 ['신제우', '맹지호', '김기훈', '이병호', '이선주']]

In [400]:
members = "강지인 김강직 김경목 김기훈 김민수 김예린 김유림 김호영 도강현 맹지호 민병창 서영호 신제우 우상욱 윤규헌 이민호 이병호 이선주 이호진 허경모 황도희".split()

In [ ]:
import random
class TeamBuilder():
    has_team = False
    teams = []

    def __init__(self, members, team_count):
        self.members = members
        self.team_count = team_count

    def create(self):
        # 멤버스 섞기
        random.shuffle(self.members)
        team_count_list = [len(self.members) // self.team_count for x in range(self.team_count)]
        for i in range(len(self.members) % self.team_count):
            team_count_list[i] += 1
        num = 0
        # 섞은 멤버 숫자에 맞춰 뽑기
        for team_count in team_count_list:
            TeamBuilder.teams.append(self.members[num : num + team_count])
            num += team_count
        
        # Teams에 있는 팀원 추가하기
        for team_number, team in enumerate(TeamBuilder.teams):
            globals()[f'{team_number}team'] = Team(team_number)
            for person in team:
                globals()[f'{team_number}team'].add_member(person)
            print(globals()[f'{team_number}team'].member)

In [ ]:
tb = TeamBuilder(members, 7)

In [ ]:
tb.create()

In [ ]:
members = "강지인 김강직 김경목 김기훈 김민수 김예린 김유림 김호영 도강현 맹지호 민병창 서영호 신제우 우상욱 윤규헌 이민호 이병호 이선주 이호진 허경모 황도희".split()

In [ ]:
team_count_list = [len(names) // team_count for x in range(team_count)]
    for idx, i in enumerate(range(0, len(names) % team_count)):
        team_count_list[idx] += 1
    random_team_list = []

In [ ]:

def team_extractor(names, team_count):
    team_count_list = [len(names) // team_count for x in range(team_count)]
    for idx, i in enumerate(range(0, len(names) % team_count)):
        team_count_list[idx] += 1
    random_team_list = []
    for x in team_count_list:
        samplelist = random.sample(names, x)
        for name in samplelist:
            names.remove(name)
        # print(samplelist)
        random_team_list.append(samplelist)
    return random_team_list

In [ ]:
class TeamBuilder:
    '''1번에 1개의 팀의 정보를 갖고 있는 클래스입니다'''
    has_team = False
    teams = []
    def __init__(self, members, team_count):
        self.members = members
        self.team_count = team_count

    def create_team(self):
        Team(self.members

In [351]:
members = "강지인 김강직 김경목 김기훈 김민수 김예린 김유림 김호영 도강현 맹지호 민병창 서영호 신제우 우상욱 윤규헌 이민호 이병호 이선주 이호진 허경모 황도희".split()
tb = TeamBuilder(members, 5)
tb.create_team()
tb.show_team_info()

AttributeError: 'TeamBuilder' object has no attribute 'create_team'

In [ ]:
Team.__dict__

In [ ]:
a.create_team()

In [ ]:
a

In [ ]:
print()

In [ ]:
members = "강지인 김강직 김경목 김기훈 김민수 김예린 김유림 김호영 도강현 맹지호 민병창 서영호 신제우 우상욱 윤규헌 이민호 이병호 이선주 이호진 허경모 황도희".split()
team_extractor(self.members, 4)
def team_extractor(names, team_count):
    team_count_list = [len(names) // team_count for x in range(team_count)]
    for idx, i in enumerate(range(0, len(names) % team_count)):
        team_count_list[idx] += 1
    random_team_list = []
    for x in team_count_list:
        samplelist = random.sample(names, x)
        for name in samplelist:
            names.remove(name)
        # print(samplelist)
        random_team_list.append(samplelist)
    return random_team_list

In [ ]:

# 이 때 팀을 짜야겠죠? 근데 팀간에 인원이 최대 1명 초과로 차이나지 않게

import math
def Team_builder(self.members, team_count):
    minimum_number = math.floor(len(self.members) / team_count)
    list_ = [x for x in [minimum_number] * team_count]
    for idx, x in enumerate(range(1, len(self.members) - minimum_number * team_count)):
        list_[idx] += 1
    return list_

In [ ]:
Team_builder(self.members, 5)

In [ ]:
for x in list_:
    samplelist = random.sample(self.members, x)
    for name in samplelist:
        self.members.remove(name)
    print(samplelist)

In [ ]:
list_ = [x for x in [minimum_number] * team_count]
for idx, x in enumerate(range(len(self.members) - minimum_number * team_count)):
    list_[idx] += 1

In [ ]:
list_

In [ ]:
print(input() + '??!')

In [ ]:
print(int(input()) - 543)

In [ ]:
base_list = [1, 1, 2, 2, 2, 8]
list_ = list(map(int,input().split(' ')))

for idx, i in enumerate(list_):
    base_list[idx] -= i
for x in base_list:
    print(x, end = ' ')

In [350]:
A = input()
B = input()

print(int(A) * int(b[-1]))
print(int(A) * int(b[-2]))
print(int(A) * int(b[0]))
print(int(A) * int(b))

TypeError: 'TeamBuilder' object is not subscriptable

In [ ]:
킹 1개, 퀸 1개, 룩 2개, 비숍 2개, 나이트 2개, 폰 8개

[1, 1, 2, 2, 2, 8]

In [98]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset("titanic")
bins = [0, 19, 30, 50, 70, 100]
labels = ['미성년자', '청년', '장년', '중년', '노년']
titanic['age_cat'] = pd.cut(titanic['age'],bins, labels = labels)
titanic.apply(lambda x : str(x['age_cat']) + '남성' if x['sex'] == 'male' else str(x['age_cat']) + '여성', axis = 1)

0        청년남성
1        장년여성
2        청년여성
3        장년여성
4        장년남성
        ...
886      청년남성
887    미성년자여성
888     nan여성
889      청년남성
890      장년남성
Length: 891, dtype: object

In [102]:
score = {
    "이름":["일식", "이식", "삼식", "사식", "오식"],
    "국어":[60, 70, 90, 80, 100],
    "영어":[70, 86, 82, 88, 100],
    "수학":[65, 82, 85, 90, 100]
}

df = pd.DataFrame(score)
df.set_index('이름', inplace = True)
df.reset_index()

   이름   국어   영어   수학
0  일식   60   70   65
1  이식   70   86   82
2  삼식   90   82   85
3  사식   80   88   90
4  오식  100  100  100

In [103]:
print('안녕하세요저는우상욱입니다.')

안녕하세요저는우상욱입니다.

In [107]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])

In [108]:
pd.merge(df1, df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [109]:
num = int(input())
time_table = []
for _ in range(num):
    time_table.append(tuple(map(int, input().split())))
print(time_table)

[(1, 4), (2, 3), (3, 5), (4, 6), (5, 7)]

In [126]:
list_ = sorted(time_table, key = lambda time_table : time_table[1])
print(list_)
for idx, x in enumerate(list_):
    if idx != 0:
        start_time = x[1]
        end_time = list_[idx - 1]

        print(start_time)
    

    # end_time = x[1]
    # start_time = list_[idx + 1][0]
    # if idx != len(list_) - 1:
    #     print(end_time, start_time)


    # if x[1] <= list_[idx + 1][0]:
    #     print('ya')

[(2, 3), (1, 4), (3, 5), (4, 6), (5, 7)]
4
5
6
7

In [127]:
sys.stdin = open('input.txt', 'r')
n = int(input())
meeting = []
for _ in range(n):
    s, e = map(int, input().split())
    meeting.append((s,e))
print(meeting)

FileNotFoundError: [Errno 2] No such file or directory: 'input.txt'

In [1]:
import pandas as pd
df1 = pd.DataFrame({
    '품종' : ['setosa','setosa','virginica','virginica'],
    '꽃잎길이' : [1.4, 1.3, 1.5, 1.3]
})
df1

          품종  꽃잎길이
0     setosa   1.4
1     setosa   1.3
2  virginica   1.5
3  virginica   1.3

In [2]:
date_str = ["2018, 1, 1", "2018, 1, 4", "2018, 1, 5", "2018, 1,6"]
idx = pd.to_datetime(date_str)
idx

DatetimeIndex(['2018-01-01', '2018-01-04', '2018-01-05', '2018-01-06'], dtype='datetime64[ns]', freq=None)

In [3]:
pd.DataFrame(idx)

           0
0 2018-01-01
1 2018-01-04
2 2018-01-05
3 2018-01-06

In [10]:
ts = pd.date_range(start = "2018-4-1", periods = 30)
ts.shift(-1)
ts.shift(1, freq = "M")
ts.shift(1, freq = 'W')

DatetimeIndex(['2018-04-08', '2018-04-08', '2018-04-08', '2018-04-08',
               '2018-04-08', '2018-04-08', '2018-04-08', '2018-04-15',
               '2018-04-15', '2018-04-15', '2018-04-15', '2018-04-15',
               '2018-04-15', '2018-04-15', '2018-04-22', '2018-04-22',
               '2018-04-22', '2018-04-22', '2018-04-22', '2018-04-22',
               '2018-04-22', '2018-04-29', '2018-04-29', '2018-04-29',
               '2018-04-29', '2018-04-29', '2018-04-29', '2018-04-29',
               '2018-05-06', '2018-05-06'],
              dtype='datetime64[ns]', freq=None)

In [18]:
data = {
    "도시": ["서울", "서울", "서울", "부산", "부산", "부산", "인천", "인천"],
    "연도": ["2015", "2010", "2005", "2015", "2010", "2005", "2015", "2010"],
    "인구": [9904312, 9631482, 9762546, 3448737, 3393191, 3512547, 2890451, 263203],
    "지역": ["수도권", "수도권", "수도권", "경상권", "경상권", "경상권", "수도권", "수도권"]
}
columns = ["도시", "연도", "인구", "지역"]
df1 = pd.DataFrame(data, columns=columns)
df1

   도시    연도       인구   지역
0  서울  2015  9904312  수도권
1  서울  2010  9631482  수도권
2  서울  2005  9762546  수도권
3  부산  2015  3448737  경상권
4  부산  2010  3393191  경상권
5  부산  2005  3512547  경상권
6  인천  2015  2890451  수도권
7  인천  2010   263203  수도권

In [20]:
df1['인구'].groupby([df1['지역'], df1['연도']]).sum().unstack('연도')

연도      2005     2010      2015
지역
경상권  3512547  3393191   3448737
수도권  9762546  9894685  12794763

In [22]:
import seaborn as sns
iris = sns.load_dataset('iris')

In [24]:
iris

     sepal_length  sepal_width  petal_length  petal_width    species
0             5.1          3.5           1.4          0.2     setosa
1             4.9          3.0           1.4          0.2     setosa
2             4.7          3.2           1.3          0.2     setosa
3             4.6          3.1           1.5          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[150 rows x 5 columns]

In [25]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [32]:
titanic['alive']

0       no
1      yes
2      yes
3      yes
4       no
      ...
886     no
887    yes
888     no
889    yes
890     no
Name: alive, Length: 891, dtype: object

In [60]:
for i in range(10):
    titanic = titanic.append(titanic)

C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)
C:\Users\wjddm\AppData\Local\Temp\ipykernel_37720\1861424828.py:2: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  titanic = titanic.append(titanic)

In [61]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,False,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,False,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,False,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,False,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,False,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,False,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,False,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,False,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,False,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,False,True

In [38]:
def change_boolean(value):
    if value == 'yes':
        return True
    else:
        return False

titanic['alive'] = titanic['alive'].apply(change_boolean)

### 1번

In [62]:
import math
import time

start = time.time()
(titanic['age'] + titanic['fare']).apply(categorize)
math.factorial(100000)
end = time.time()

print(f"{end - start:.5f} sec")

0.32225 sec

### 2번

In [64]:
import math
import time

start = time.time()
titanic[['age', 'fare']].apply(lambda x : categorize(x['age'] + x['fare']), axis =1)
math.factorial(100000)
end = time.time()

print(f"{end - start:.5f} sec")

9.23425 sec

In [48]:
def categorize(value):
    if value < 20:
        return '작음'
    elif value < 50:
        return '보통'
    else :
        return '큼'

# 1번 예시(apply에 lambda를 사용하지 않는 경우 , 배열연산 & apply 활용)
(titanic['age'] + titanic['fare']).apply(categorize)

# 2번 예시(람다 식으로 함수를 활용한 경우)
titanic.apply(lambda x : categorize(x['age'] + x['fare']), axis =1)

저는 보통 2번 예시처럼 데이터를 가공했는데, 오늘 수업을 듣고 보니
1번 예시처럼 배열 연산과 apply만 활용해서 조금 더 간단하게 코딩할 수 있는 걸 알았습니다!
그렇다면 lambda를 굳이 쓸 필요 없이 항상 1번 예시가 조금 더 좋은 방법 같은데,
이런 경우에는 2번처럼 람다를 굳이 쓸 필요가 있냐는 질문이였습니다!

0      보통
1       큼
2      보통
3       큼
4      보통
       ..
886    보통
887    보통
888     큼
889     큼
890    보통
Length: 891, dtype: object

In [ ]:
데이터를 가공할 때 , apply를 활용하면서, lambda 식을 주로 썼습니다.
아까 보내드렸던 것처럼 한 컬럼짜리 시리즈에도, lambda를 주로 적용해왔는데, 방금 apply에 람다를 사용할 필요가 없다는 걸 알았습니다!

그런데 데이터를 가공하다보면, 두 개의 시리즈를 연산해야하는 경우가 발생하는데,

titanic['age'] + titanic['fare']